; compiling (LET (#) ...)
; compiling (QUICKLISP-CLIENT:QUICKLOAD :STREAMS)To load "streams":
  Load 1 ASDF system:
    streams
; Loading "streams"
............

CL-USER> (in-package :streams/expr)
#<PACKAGE "STREAMS/EXPR">

STREAMS/EXPR> (parse-explain "(@WALT Walt Disney (f format) /regex/ (d type))")

 ATOM-SEQ    |   ("@" "WALT")
 ATOM-VALUE  |   ("Walt Disney")
 ATOM-MODS   |   ((("f" "format") NIL NIL NIL NIL NIL)
                  ("/" (("regex" NIL NIL))) (("d" "type") NIL NIL NIL NIL NIL))
 METADATA    |   NIL
 HASH        |   NIL
 COMMENT     |   NIL
NIL
; compiling (SETF (FDEFINITION #) ...)
; compiling (SETF (FDEFINITION #) ...)
; compiling (QUICKLISP-CLIENT:QUICKLOAD :STREAMS)To load "streams":
  Load 1 ASDF system:
    streams
; Loading "streams"
....

STREAMS/EXPR> (parse-explain "(@WALT Walt Disney (f format) /regex/ (d type))")

 ATOM-SEQ    |   ("@" "WALT")
 ATOM-VALUE  |   ("Walt Disney")
 ATOM-MODS   |   ((("f" "format") NIL NIL NIL NIL NIL)
                  ("/" (("regex" NIL NIL))) (("d" "type") NIL NIL NIL NIL NIL))
 METADATA    |   NIL
 HASH        |   NIL
 COMMENT     |   NIL
NIL

STREAMS/EXPR> (parse-explain "(@WALT Walt Disney (f format :fsub fsubvalue) /regex/ (d type))")

 ATOM-SEQ    |   ("@" "WALT")
 ATOM-VALUE  |   ("Walt Disney (f format")
 ATOM-MODS   |   NIL
 METADATA    |   (((":" "fsub") ("fsubvalue)")
                   (("/" (("regex" NIL NIL)))
                    (("d" "type") NIL NIL NIL NIL NIL))))
 HASH        |   NIL
 COMMENT     |   NIL
NIL
; compiling (SETF (FDEFINITION #) ...)
; compiling (SETF (FDEFINITION #) ...)
STREAMS/EXPR> (parse-explain "(@WALT Walt Disney (f format (d fdefinition)) /regex/ (d type))")

 ATOM-SEQ    |   ("@" "WALT")
 ATOM-VALUE  |   ("Walt Disney")
 ATOM-MODS   |   ((("f" "format") NIL (("d" "fdefinition") NIL NIL NIL NIL NIL)
                   NIL NIL NIL)
                  ("/" (("regex" NIL NIL))) (("d" "type") NIL NIL NIL NIL NIL))
 METADATA    |   NIL
 HASH        |   NIL
 COMMENT     |   NIL
NIL

STREAMS/EXPR> (parse-explain "(@WALT Walt Disney (f format :fsub (d fdefinition)) /regex/ (d type))")

 ATOM-SEQ    |   ("@" "WALT")
 ATOM-VALUE  |   ("Walt Disney (f format")
 ATOM-MODS   |   NIL
 METADATA    |   (((":" "fsub") NIL
                   ((("d" "fdefinition") NIL NIL NIL NIL NIL))))
 HASH        |   NIL
 COMMENT     |   NIL
NIL
; compiling (DEFUN =FORMAT-FORM ...)
WARNING: redefining STREAMS/EXPR::=FORMAT-FORM in DEFUN

STREAMS/EXPR> (parse-explain "(@WALT Walt Disney (f format :fsub (d fdefinition)) /regex/ (d type))")

 ATOM-SEQ    |   ("@" "WALT")
 ATOM-VALUE  |   ("Walt Disney (f format")
 ATOM-MODS   |   NIL
 METADATA    |   (((":" "fsub") NIL
                   ((("d" "fdefinition") NIL NIL NIL NIL NIL))))
 HASH        |   NIL
 COMMENT     |   NIL
NIL
; compiling (SETF (FDEFINITION #) ...)
STREAMS/EXPR> (parse-explain "(@WALT Walt Disney (f format :fsub (d fdefinition)) /regex/ (d type))")

 ATOM-SEQ    |   ("@" "WALT")
 ATOM-VALUE  |   ("Walt Disney")
 ATOM-MODS   |   ((("f" "format") NIL NIL
                   (((":" "fsub") NIL
                     ((("d" "fdefinition") NIL NIL NIL NIL NIL))))
                   NIL NIL)
                  ("/" (("regex" NIL NIL))) (("d" "type") NIL NIL NIL NIL NIL))
 METADATA    |   NIL
 HASH        |   NIL
 COMMENT     |   NIL
NIL

STREAMS/EXPR> 
