; compiling (LET (#) ...)
; compiling (QUICKLISP-CLIENT:QUICKLOAD :STREAMS)To load "streams":
  Load 1 ASDF system:
    streams
; Loading "streams"
........

CL-USER> (in-package :streams/expr)
#<PACKAGE "STREAMS/EXPR">

STREAMS/EXPR> (parse-explain "(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))")

  MX OUTPUT

(("c" "WALT") ("wvalue" (("@" "WED") NIL NIL NIL NIL NIL) "wvalue2")
 ((("f" "waltformat") ("waltformatvalue") NIL NIL NIL NIL))
 (((":" "csub") ("csubvalue") (("/" (("csubregex" "csugenv" "csugconsume"))))))
 NIL NIL)

  LABEL      |   MX OUTPUT

  ATOM-SEQ   |   ("c" "WALT")
  ATOM-VALUE |   ("wvalue" (("@" "WED") NIL NIL NIL NIL NIL) "wvalue2")
  ATOM-MODS  |   ((("f" "waltformat") ("waltformatvalue") NIL NIL NIL NIL))
  METADATA   |   (((":" "csub") ("csubvalue")
                   (("/" (("csubregex" "csugenv" "csugconsume"))))))
  HASH       |   NIL
  COMMENT    |   NIL

  MSL

"(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))"
; compiling (DEFUN EXPLAIN ...)
WARNING: redefining STREAMS/EXPR::EXPLAIN in DEFUN

STREAMS/EXPR> (parse-explain "(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))")

  MX OUTPUT

(("c" "WALT") ("wvalue" (("@" "WED") NIL NIL NIL NIL NIL) "wvalue2")
 ((("f" "waltformat") ("waltformatvalue") NIL NIL NIL NIL))
 (((":" "csub") ("csubvalue") (("/" (("csubregex" "csugenv" "csugconsume"))))))
 NIL NIL)

  LABEL      |   MX OUTPUT

  ATOM-SEQ   |   ("c" "WALT")
STREAMS/EXPR>

; No value; compiling (DEFUN EXPLAIN ...)
STREAMS/EXPR> (parse-explain "(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))")

  MX OUTPUT

(("c" "WALT") ("wvalue" (("@" "WED") NIL NIL NIL NIL NIL) "wvalue2")
 ((("f" "waltformat") ("waltformatvalue") NIL NIL NIL NIL))
 (((":" "csub") ("csubvalue") (("/" (("csubregex" "csugenv" "csugconsume"))))))
 NIL NIL)

  LABEL      |   MX OUTPUT

  ATOM-SEQ   |   ("c" "WALT")
; compiling (DEFUN EXPLAIN ...)
STREAMS/EXPR> (parse-explain "(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))")

  MX OUTPUT

(("c" "WALT") ("wvalue" (("@" "WED") NIL NIL NIL NIL NIL) "wvalue2")
 ((("f" "waltformat") ("waltformatvalue") NIL NIL NIL NIL))
 (((":" "csub") ("csubvalue") (("/" (("csubregex" "csugenv" "csugconsume"))))))
 NIL NIL)

  LABEL      |   MX OUTPUT

  ATOM-SEQ   |   ("c" "WALT")(ATOM-VALUE
                              (wvalue ((@ WED) NIL NIL NIL NIL NIL) wvalue2))

  MSL

"(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))"
; compiling (DEFUN EXPLAIN ...)
STREAMS/EXPR> (parse-explain "(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))")

  MX OUTPUT

(("c" "WALT") ("wvalue" (("@" "WED") NIL NIL NIL NIL NIL) "wvalue2")
 ((("f" "waltformat") ("waltformatvalue") NIL NIL NIL NIL))
 (((":" "csub") ("csubvalue") (("/" (("csubregex" "csugenv" "csugconsume"))))))
 NIL NIL)

  LABEL      |   MX OUTPUT

  ATOM-SEQ   |   ("c" "WALT")(wvalue ((@ WED) NIL NIL NIL NIL NIL) wvalue2)

  MSL

"(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))"
; compiling (DEFUN EXPLAIN ...)
STREAMS/EXPR> (parse-explain "(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))")

  MX OUTPUT

(("c" "WALT") ("wvalue" (("@" "WED") NIL NIL NIL NIL NIL) "wvalue2")
 ((("f" "waltformat") ("waltformatvalue") NIL NIL NIL NIL))
 (((":" "csub") ("csubvalue") (("/" (("csubregex" "csugenv" "csugconsume"))))))
 NIL NIL)

  LABEL      |   MX OUTPUT

  ATOM-SEQ   |   ("c" "WALT")!(wvalue ((@ WED) NIL NIL NIL NIL NIL) wvalue2)

  MSL

"(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))"
; compiling (DEFUN EXPLAIN ...)
STREAMS/EXPR> (parse-explain "(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))")

  MX OUTPUT

(("c" "WALT") ("wvalue" (("@" "WED") NIL NIL NIL NIL NIL) "wvalue2")
 ((("f" "waltformat") ("waltformatvalue") NIL NIL NIL NIL))
 (((":" "csub") ("csubvalue") (("/" (("csubregex" "csugenv" "csugconsume"))))))
 NIL NIL)

  LABEL      |   MX OUTPUT

  ATOM-SEQ   |   ("c" "WALT")!wvalue

  MSL

"(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))"
; compiling (DEFUN EXPLAIN ...)
STREAMS/EXPR> (parse-explain "(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))")

  MX OUTPUT

(("c" "WALT") ("wvalue" (("@" "WED") NIL NIL NIL NIL NIL) "wvalue2")
 ((("f" "waltformat") ("waltformatvalue") NIL NIL NIL NIL))
 (((":" "csub") ("csubvalue") (("/" (("csubregex" "csugenv" "csugconsume"))))))
 NIL NIL)

  LABEL      |   MX OUTPUT

  ATOM-SEQ   |   ("c" "WALT")!((@ WED) NIL NIL NIL NIL NIL)

  MSL

"(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))"
; compiling (DEFUN EXPLAIN ...)
STREAMS/EXPR> (parse-explain "(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))")

  MX OUTPUT

(("c" "WALT") ("wvalue" (("@" "WED") NIL NIL NIL NIL NIL) "wvalue2")
 ((("f" "waltformat") ("waltformatvalue") NIL NIL NIL NIL))
 (((":" "csub") ("csubvalue") (("/" (("csubregex" "csugenv" "csugconsume"))))))
 NIL NIL)

  LABEL      |   MX OUTPUT

  ATOM-SEQ   |   ("c" "WALT")
  ATOM-SEQ   |   ("@" "WED")
  ATOM-VALUE |   NIL
  ATOM-MODS  |   NIL
  METADATA   |   NIL
  HASH       |   NIL
  COMMENT    |   NIL

  MSL

"(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))"
; compiling (DEFUN EXPLAIN ...)
STREAMS/EXPR> (parse-explain "(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))")

  MX OUTPUT

(("c" "WALT") ("wvalue" (("@" "WED") NIL NIL NIL NIL NIL) "wvalue2")
 ((("f" "waltformat") ("waltformatvalue") NIL NIL NIL NIL))
 (((":" "csub") ("csubvalue") (("/" (("csubregex" "csugenv" "csugconsume"))))))
 NIL NIL)

  LABEL      |   MX OUTPUT

  ATOM-SEQ   |   ("c" "WALT")!((@ WED) NIL NIL NIL NIL NIL)

  MSL

"(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))"
; compiling (DEFUN EXPLAIN ...)

; file: C:/Users/David/AppData/Local/Temp/slime13
; in: DEFUN EXPLAIN
;     (LET* ((STREAMS/EXPR::ITEM (CAR STREAMS/EXPR::ITEM-LIST))
;            (STREAMS/EXPR::ITEM-LABEL (CAR STREAMS/EXPR::ITEM))
;            (STREAMS/EXPR::ITEM-VALUE (CAR (CDR STREAMS/EXPR::ITEM)))
;            (STREAMS/EXPR::ITEM-SUBLIST (CAR (CDR STREAMS/EXPR::ITEM-VALUE)))
;            (STREAMS/EXPR::ATOM-EXPLAINER
;             '(STREAMS/EXPR::ATOM-SEQ STREAMS/EXPR::ATOM-VALUE
;               STREAMS/EXPR::ATOM-MODS STREAMS/EXPR::METADATA STREAMS/EXPR::HASH
;               STREAMS/EXPR::COMMENT)))
;       (COND ((NOT STREAMS/EXPR::ITEM-LIST) NIL)
;             ((EQ (LENGTH STREAMS/EXPR::ITEM-SUBLIST) 6) (PRINC "!")
;              (PRINC STREAMS/EXPR::ITEM-SUBLIST))
;             (T
;              (FORMAT T "~%  ~A~13T| ~15T ~S" STREAMS/EXPR::ITEM-LABEL
;                      STREAMS/EXPR::ITEM-VALUE)
;              (STREAMS/EXPR::EXPLAIN (CDR STREAMS/EXPR::ITEM-LIST)))))
;
; caught STYLE-WARNING:
;   The variable ATOM-EXPLAINER is defined but never used.
;
; compilation unit finished
;   caught 1 STYLE-WARNING condition

STREAMS/EXPR> (parse-explain "(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))")

  MX OUTPUT

(("c" "WALT") ("wvalue" (("@" "WED") NIL NIL NIL NIL NIL) "wvalue2")
 ((("f" "waltformat") ("waltformatvalue") NIL NIL NIL NIL))
 (((":" "csub") ("csubvalue") (("/" (("csubregex" "csugenv" "csugconsume"))))))
 NIL NIL)

  LABEL      |   MX OUTPUT

  ATOM-SEQ   |   ("c" "WALT")!((@ WED) NIL NIL NIL NIL NIL)

  MSL

"(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))"
; compiling (DEFUN EXPLAIN ...)
STREAMS/EXPR> (parse-explain "(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))")

  MX OUTPUT

(("c" "WALT") ("wvalue" (("@" "WED") NIL NIL NIL NIL NIL) "wvalue2")
 ((("f" "waltformat") ("waltformatvalue") NIL NIL NIL NIL))
 (((":" "csub") ("csubvalue") (("/" (("csubregex" "csugenv" "csugconsume"))))))
 NIL NIL)

  LABEL      |   MX OUTPUT

  ATOM-SEQ   |   ("c" "WALT")!
  ATOM-SEQ   |   ("@" "WED")
  ATOM-VALUE |   NIL
  ATOM-MODS  |   NIL
  METADATA   |   NIL
  HASH       |   NIL
  COMMENT    |   NIL

  MSL

"(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))"
; compiling (DEFUN EXPLAIN ...)
STREAMS/EXPR> (parse-explain "(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))")

  MX OUTPUT

(("c" "WALT") ("wvalue" (("@" "WED") NIL NIL NIL NIL NIL) "wvalue2")
 ((("f" "waltformat") ("waltformatvalue") NIL NIL NIL NIL))
 (((":" "csub") ("csubvalue") (("/" (("csubregex" "csugenv" "csugconsume"))))))
 NIL NIL)

  LABEL      |   MX OUTPUT

  ATOM-SEQ   |   ("c" "WALT")
  ATOM-SEQ   |   ("@" "WED")
  ATOM-VALUE |   NIL
  ATOM-MODS  |   NIL
  METADATA   |   NIL
  HASH       |   NIL
  COMMENT    |   NIL
  ATOM-VALUE |   NIL
  ATOM-MODS  |   ((("f" "waltformat") ("waltformatvalue") NIL NIL NIL NIL))
  METADATA   |   (((":" "csub") ("csubvalue")
                   (("/" (("csubregex" "csugenv" "csugconsume"))))))
  HASH       |   NIL
  COMMENT    |   NIL

  MSL

"(c WALT wvalue (@WED) wvalue2 (f waltformat waltformatvalue)  :csub csubvalue /csubregex/csugenv csugconsume))"

STREAMS/EXPR>
