; compiling (LET (#) ...)
; compiling (QUICKLISP-CLIENT:QUICKLOAD :STREAMS)To load "streams":
  Load 1 ASDF system:
    streams
; Loading "streams"
........

CL-USER> (in-package :streams/expr)
#<PACKAGE "STREAMS/EXPR">

STREAMS/EXPR> (parse "(@WALT Walt Disney (f other) (d again) :wife (f something) (f f2 :fsub fsubvalue /fregex/fenv fconsume //fcomment) (d another) (d d2))" (=@-form))
(("@" "WALT") ("Walt Disney")
 ((("f" "other") NIL NIL NIL NIL NIL) (("d" "again") NIL NIL NIL NIL NIL))
 (((":" "wife") NIL
   ((("f" "something") NIL NIL NIL NIL NIL)
    (("f" "f2") ":fsub fsubvalue" ("/" (("fregex" "fenv" "fconsume"))) NIL NIL
     "fcomment")
    (("d" "another") NIL NIL NIL NIL NIL) (("d" "d2") NIL NIL NIL NIL NIL))))
 NIL NIL)
T
T

STREAMS/EXPR> (parse "(@WALT Walt Disney (f other) (d again) :wife (f something) (f f2 :fsub fsubvalue /fregex/fenv fconsume //fcomment) (d another) (d d2))" (=@-form))
(("@" "WALT") ("Walt Disney")
 ((("f" "other") NIL NIL NIL NIL NIL) (("d" "again") NIL NIL NIL NIL NIL))
 (((":" "wife") NIL
   ((("f" "something") NIL NIL NIL NIL NIL)
    (("f" "f2") ":fsub fsubvalue" ("/" (("fregex" "fenv" "fconsume"))) NIL NIL
     "fcomment")
    (("d" "another") NIL NIL NIL NIL NIL) (("d" "d2") NIL NIL NIL NIL NIL))))
 NIL NIL)
T
T
; compiling (QUICKLISP-CLIENT:QUICKLOAD :STREAMS)To load "streams":
  Load 1 ASDF system:
    streams
; Loading "streams"

; compiling (QUICKLISP-CLIENT:QUICKLOAD :STREAMS)To load "streams":
  Load 1 ASDF system:
    streams
; Loading "streams"
...

STREAMS/EXPR> (parse "(@WALT Walt Disney (f other) (d again) :wife (f something) (f f2 :fsub fsubvalue /fregex/fenv fconsume //fcomment) (d another) (d d2))" (=@-form))
(("@" "WALT") "Walt Disney"
 ((("f" "other") NIL NIL NIL NIL NIL NIL)
  (("d" "again") NIL NIL NIL NIL NIL NIL))
 (((":" "wife") NIL
   ((("f" "something") NIL NIL NIL NIL NIL NIL)
    (("f" "f2") NIL NIL NIL
     (((":" "fsub") "fsubvalue" (("/" (("fregex" "fenv" "fconsume")))))) NIL
     "fcomment")
    (("d" "another") NIL NIL NIL NIL NIL NIL)
    (("d" "d2") NIL NIL NIL NIL NIL NIL))))
 NIL NIL)
T
T
; compiling (QUICKLISP-CLIENT:QUICKLOAD :STREAMS)To load "streams":
  Load 1 ASDF system:
    streams
; Loading "streams"

; compiling (QUICKLISP-CLIENT:QUICKLOAD :STREAMS)To load "streams":
  Load 1 ASDF system:
    streams
; Loading "streams"
...

STREAMS/EXPR> (parse "(@WALT Walt Disney (f other) (d again) :wife (f something) (f f2 :fsub fsubvalue /fregex/fenv fconsume //fcomment) (d another) (d d2))" (=@-form))
(("@" "WALT") "Walt Disney"
 ((("f" "other") NIL NIL NIL NIL NIL) (("d" "again") NIL NIL NIL NIL NIL))
 (((":" "wife") NIL
   ((("f" "something") NIL NIL NIL NIL NIL)
    (("f" "f2") NIL NIL
     (((":" "fsub") "fsubvalue" (("/" (("fregex" "fenv" "fconsume")))))) NIL
     "fcomment")
    (("d" "another") NIL NIL NIL NIL NIL) (("d" "d2") NIL NIL NIL NIL NIL))))
 NIL NIL)
T
T
; compiling (QUICKLISP-CLIENT:QUICKLOAD :STREAMS)To load "streams":
  Load 1 ASDF system:
    streams
; Loading "streams"
...

STREAMS/EXPR> (parse "(@WALT Walt Disney (f other) (d again) :wife (f something) (f f2 :fsub fsubvalue /fregex/fenv fconsume //fcomment) (d another) (d d2))" (=@-form))
(("@" "WALT") "Walt Disney"
 ((("f" "other") NIL NIL NIL NIL NIL) (("d" "again") NIL NIL NIL NIL NIL))
 (((":" "wife") NIL
   ((("f" "something") NIL NIL NIL NIL NIL)
    (("f" "f2") NIL NIL
     (((":" "fsub") "fsubvalue" (("/" (("fregex" "fenv" "fconsume")))))) NIL
     "fcomment")
    (("d" "another") NIL NIL NIL NIL NIL) (("d" "d2") NIL NIL NIL NIL NIL))))
 NIL NIL)
T
T
; compiling (DEFUN =MSL-EXPRESSION ...)
; compiling (DEFUN PARSE-MSL ...)
; compiling (DEFUN PARSE-MSL ...)
; compiling (DEFUN =MSL-EXPRESSION ...);
                                       ; compilation unit aborted
                                       ;   caught 2 fatal ERROR conditions
;
; compilation unit aborted
;   caught 2 fatal ERROR conditions
; compiling (DEFUN =MSL-EXPRESSION ...)
; compiling (DEFUN PARSE-MSL ...)
;
; compilation unit aborted
;   caught 2 fatal ERROR conditions
; compiling (DEFUN PARSE-MSL ...)
STREAMS/EXPR> (parse "(@WALT Walt Disney (f other) (d again) :wife (f something) (f f2 :fsub fsubvalue /fregex/fenv fconsume //fcomment) (d another) (d d2))" (=@-form))

(("@" "WALT") "Walt Disney"
 ((("f" "other") NIL NIL NIL NIL NIL) (("d" "again") NIL NIL NIL NIL NIL))
 (((":" "wife") NIL
   ((("f" "something") NIL NIL NIL NIL NIL)
    (("f" "f2") NIL NIL
     (((":" "fsub") "fsubvalue" (("/" (("fregex" "fenv" "fconsume")))))) NIL
     "fcomment")
    (("d" "another") NIL NIL NIL NIL NIL) (("d" "d2") NIL NIL NIL NIL NIL))))
 NIL NIL)
T
T

STREAMS/EXPR> (parse-msl "(@WALT Walt Disney (f other) (d again) :wife (f something) (f f2 :fsub fsubvalue /fregex/fenv fconsume //fcomment) (d another) (d d2))")
(("@" "WALT") "Walt Disney"
 ((("f" "other") NIL NIL NIL NIL NIL) (("d" "again") NIL NIL NIL NIL NIL))
 (((":" "wife") NIL
   ((("f" "something") NIL NIL NIL NIL NIL)
    (("f" "f2") NIL NIL
     (((":" "fsub") "fsubvalue" (("/" (("fregex" "fenv" "fconsume")))))) NIL
     "fcomment")
    (("d" "another") NIL NIL NIL NIL NIL) (("d" "d2") NIL NIL NIL NIL NIL))))
 NIL NIL)
T
T

STREAMS/EXPR> 
